Documents/СоглашениеОРасторженииДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СоглашениеОРасторженииДоговора</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоРассрочкам</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоЗаказДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.КонверсияВходящихКонтактов</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРасторженияДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСписанияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСписанияТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДополнительныхЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженоИзПостроителя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПотолка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоПрайсу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоПрайсу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СоглашениеОРасторженииДоговора/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Договор
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "Договор";
    КомандаПечати.Представление = НСтр("ru = 'Договор'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 1;
	
	//Договор в рассрочку
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "ДоговорРассрочка";
    КомандаПечати.Представление = НСтр("ru = 'Договор (рассрочка)'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 2;
		
	//Приложение (по комнатам)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "Смета";
    КомандаПечати.Представление = НСтр("ru = 'Смета'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 3;
	
	Если ПолучитьФункциональнуюОпцию("ПечатьФормМонтажаИзЗаказДоговора") Тогда
		//Акт выполненных работ 
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "АктВыполненныхРабот";
		КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.Порядок = 4;
		
		//Гарантийный талон 
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "ГарантийныйТалон";
		КомандаПечати.Представление = НСтр("ru = 'Гарантийный талон'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.Порядок = 5;
		
		//Комплект для монтажников
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
		КомандаПечати.Идентификатор = "КомплектДляМонтажников";
		КомандаПечати.Представление = НСтр("ru = 'Комплект для монтажников'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
		КомандаПечати.Порядок = 7;
	КонецЕсли;

	//Комплект для клиента
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.ЗаказДоговор";
    КомандаПечати.Идентификатор = "КомплектДляКлиента";
    КомандаПечати.Представление = НСтр("ru = 'Комплект для клиента'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.Порядок = 6;
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса(СДаннымиПоМонтажу=Ложь) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументРасторжение.Ссылка,
	|	ДокументРасторжение.ВерсияДанных,
	|	ДокументРасторжение.ПометкаУдаления,
	|	ДокументРасторжение.Номер,
	|	ДокументРасторжение.Дата КАК ДатаДокумента,
	|	ВЫРАЗИТЬ("""" КАК Строка(15)) КАК Дата,
	|	ДокументРасторжение.Проведен,
	|	ДокументРасторжение.ЗаказДоговор.Адрес КАК Адрес,
	|	ДокументРасторжение.ЗаказДоговор.Валюта КАК Валюта,
	|	ДокументРасторжение.ЗаказДоговор.ВидСкидки КАК ВидСкидки,
	|	ДокументРасторжение.ЗаказДоговор.ИсполнительЗамера КАК ИсполнительЗамера,
	|	ДокументРасторжение.Комментарий,
	|	ДокументРасторжение.ЗаказДоговор.Контрагент КАК Контрагент,
	|	ВЫБОР КОГДА НЕ ДокументРасторжение.ЗаказДоговор.Контрагент.НаименованиеПолное = """"
	|		ТОГДА
	|			ДокументРасторжение.ЗаказДоговор.Контрагент.НаименованиеПолное
	|		ИНАЧЕ
	|			ДокументРасторжение.ЗаказДоговор.Контрагент.Наименование
	|		КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ДокументРасторжение.ЗаказДоговор.Контрагент.КонтактноеЛицоПодписант КАК КонтрагентПодписант,
	|	ДокументРасторжение.ЗаказДоговор.Контрагент.КонтактноеЛицоПодписант.Должность КАК КонтрагентПодписантДолжность,
	|	ДокументРасторжение.ЗаказДоговор.Менеджер КАК Менеджер,
	|	ДокументРасторжение.ЗаказДоговор.НомерДоговора КАК НомерДоговора,
	|	ДокументРасторжение.ЗаказДоговор КАК Основание,
	|	ДокументРасторжение.Автор,
	|	ДокументРасторжение.СуммаДокумента,
	|	ИСТИНА КАК ДоговорРассторгнут,
	|	ДокументРасторжение.ПричинаРасторженияДоговора,
	|	ДокументРасторжение.Организация КАК Организация,
	|	ДокументРасторжение.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДокументРасторжение.Организация.ЯвляетсяПлательщикомНДС КАК ЯвляетсяПлательщикомНДС,
	|	ДокументРасторжение.Организация.Руководитель КАК ОрганизацияПодписант,
	|	ДокументРасторжение.Организация.Руководитель.Должность КАК ОрганизацияПодписантДолжность,
	|	ДокументРасторжение.ЗаказДоговор.ВидЦен КАК ВидЦен,
	|	ДокументРасторжение.ТоварыУслуги.(
	|		Ссылка,
	|		НомерСтроки,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|		Количество,
	|		ЕдиницаИзмерения,
	|		Коэффициент,
	|		Цена,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		ПроцентСкидки,
	|		СуммаСкидки,
	|		ЦветФактуры,
	|		НомерПотолка,
	|		Комната
	|	) КАК ТоварыУслуги,
	|	ДокументРасторжение.Материалы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура,
	|		ХарактеристикаНоменклатуры,
	|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|		Количество,
	|		ЕдиницаИзмерения,
	|		Коэффициент
	|	) КАК Материалы,
	|	ДокументРасторжение.ЗаказДоговор.Представители.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФИО,
	|		КонтактныйТелефон,
	|		Комментарий
	|	),
	|	ДокументРасторжение.ЗаказДоговор.ГрафикОплат.(
	|		Ссылка,
	|		НомерСтроки,
	|		ДатаПлатежа КАК ДатаПлатежаДокумент,
	|		""текстовая строка"" КАК ДатаПлатежа,
	|		Сумма
	|	) КАК ГрафикОплат,
	|	ДокументРасторжение.Представление,
	|	ДокументРасторжение.МоментВремени,
	|	РасчетыПоЗаказамОстатки.СуммаОстаток КАК ДолгПоДоговору,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК ОбщийДолг,
	|	ДокументыУдостоверяющиеЛичность.Вид КАК ПаспортВид,
	|	ДокументыУдостоверяющиеЛичность.Серия КАК ПаспортСерия,
	|	ДокументыУдостоверяющиеЛичность.Номер КАК ПаспортНомер,
	|	ДокументыУдостоверяющиеЛичность.КемВыдан КАК ПаспортКемВыдан,
	|	ДокументыУдостоверяющиеЛичность.ДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ВалютаУчета.Значение.Ссылка КАК ВалютаУчета";
	
	Если СДаннымиПоМонтажу Тогда
		ТекстЗапроса = ТекстЗапроса +
		",
		|	Монтаж.Бригада КАК Бригада,
		|	Монтаж.Бригадир КАК Бригадир,
		|	Монтаж.ДатаМонтажа КАК ДатаМонтажа,
		|	Монтаж.ВремяНачала КАК ВремяНачала,
		|	Монтаж.ВремяОкончания КАК ВремяОкончания,
		|	""01.01.0001"" КАК ДатаМонтажаФормат,
		|	""00:00:00"" КАК ВремяНачалаФормат,
		|	""00:00:00"" КАК ВремяОкончанияФормат";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	" ИЗ
	|	Документ.СоглашениеОРасторженииДоговора КАК ДокументРасторжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
    |		ПО ДокументРасторжение.ЗаказДоговор.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
    |			И ДокументРасторжение.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
	|		ПО ДокументРасторжение.ЗаказДоговор.Контрагент.ДокументУдостоверяющийЛичность = ДокументыУдостоверяющиеЛичность.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
    |		ПО ДокументРасторжение.ЗаказДоговор = РасчетыПоЗаказамОстатки.Заказ";
	
	Если СДаннымиПоМонтажу Тогда
		ТекстЗапроса = ТекстЗапроса +
		"		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж КАК Монтаж
		|		ПО (Монтаж.Основание = ДокументРасторжение.ЗаказДоговор)
		|		И НЕ Монтаж.ПометкаУдаления";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ", Константа.ВалютаУчета КАК ВалютаУчета";
	
	ТекстЗапроса = ТекстЗапроса +
	" ГДЕ
	|	ДокументРасторжение.Ссылка В(&МассивОбъектов)";	

	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов, ВключатьДанныеМонтажей = Истина) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВключатьДанныеМонтажей", ВключатьДанныеМонтажей);
	Запрос.УстановитьПараметр("КолонкаАртикул", Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить());
	Запрос.Текст = 	
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДокументРасторжение.Ссылка КАК Ссылка,
    |	ДокументРасторжение.ВерсияДанных КАК ВерсияДанных,
    |	ДокументРасторжение.ПометкаУдаления КАК ПометкаУдаления,
    |	ДокументРасторжение.Номер КАК Номер,
    |	ДокументРасторжение.Дата КАК ДатаДокумента,
    |	ВЫРАЗИТЬ("""" КАК Строка(15)) КАК Дата,
    |	ДокументРасторжение.Проведен КАК Проведен,
    |	ДокументРасторжение.ЗаказДоговор.Адрес КАК Адрес,
    |	ДокументРасторжение.ЗаказДоговор.Валюта КАК Валюта,
    |	ДокументРасторжение.ЗаказДоговор.ВидСкидки КАК ВидСкидки,
    |	ДокументРасторжение.ЗаказДоговор.ИсполнительЗамера КАК ИсполнительЗамера,
    |	ДокументРасторжение.Комментарий КАК Комментарий,
    |	ДокументРасторжение.ЗаказДоговор.Контрагент КАК Контрагент,
    |	ВЫБОР
    |		КОГДА НЕ ДокументРасторжение.ЗаказДоговор.Контрагент.НаименованиеПолное = """"
    |			ТОГДА ДокументРасторжение.ЗаказДоговор.Контрагент.НаименованиеПолное
    |		ИНАЧЕ ДокументРасторжение.ЗаказДоговор.Контрагент.Наименование
    |	КОНЕЦ КАК ПредставлениеКонтрагента,
    |	ДокументРасторжение.ЗаказДоговор.Контрагент.КонтактноеЛицоПодписант КАК КонтрагентПодписант,
    |	ДокументРасторжение.ЗаказДоговор.Контрагент.КонтактноеЛицоПодписант.Должность КАК КонтрагентПодписантДолжность,
    |	ДокументРасторжение.ЗаказДоговор.Менеджер КАК Менеджер,
    |	ДокументРасторжение.ЗаказДоговор.НомерДоговора КАК НомерДоговора,
    |	ДокументРасторжение.ЗаказДоговор КАК Основание,
    |	ДокументРасторжение.Автор КАК Автор,
    |	ДокументРасторжение.ЗаказДоговор.Менеджер КАК МенеджерДоговора,
    |	ДокументРасторжение.СуммаДокумента КАК СуммаДокумента,
    |	ДокументРасторжение.СуммаДокумента КАК Сумма,
    |	ИСТИНА КАК ДоговорРассторгнут,
    |	ДокументРасторжение.ПричинаРасторженияДоговора КАК ПричинаРассторженияДоговора,
	|	ДокументРасторжение.ПричинаРасторженияДоговора КАК ПричинаРасторженияДоговора,
	|	ДокументРасторжение.Организация КАК Организация,
    |	ДокументРасторжение.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
    |	ДокументРасторжение.Организация.ЯвляетсяПлательщикомНДС КАК ЯвляетсяПлательщикомНДС,
    |	ДокументРасторжение.Организация.Руководитель КАК ОрганизацияПодписант,
    |	ДокументРасторжение.Организация.Руководитель.Должность КАК ОрганизацияПодписантДолжность,
    |	ДокументРасторжение.ЗаказДоговор.ВидЦен КАК ВидЦен,
    |	ДокументРасторжение.Представление КАК Представление,
    |	ДокументРасторжение.МоментВремени КАК МоментВремени,
    |	ЕСТЬNULL(РасчетыПоЗаказамОстатки.СуммаОстаток, 0) КАК ДолгПоДоговору,
    |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток, 0) КАК ОбщийДолг,
    |	ДокументыУдостоверяющиеЛичность.Вид КАК ПаспортВид,
    |	ДокументыУдостоверяющиеЛичность.Серия КАК ПаспортСерия,
    |	ДокументыУдостоверяющиеЛичность.Номер КАК ПаспортНомер,
    |	ДокументыУдостоверяющиеЛичность.КемВыдан КАК ПаспортКемВыдан,
    |	ДокументыУдостоверяющиеЛичность.ДатаВыдачи КАК ПаспортДатаВыдачи,
    |	ВалютаУчета.Значение.Ссылка КАК ВалютаУчета,
    |	Монтаж.Бригада КАК Бригада,
    |	Монтаж.Бригадир КАК Бригадир,
    |	Монтаж.ДатаМонтажа КАК ДатаМонтажа,
    |	Монтаж.ВремяНачала КАК ВремяНачала,
    |	Монтаж.ВремяОкончания КАК ВремяОкончания,
	|	0 КАК ИтогоСуммаНДС
    |ИЗ
    |	Документ.СоглашениеОРасторженииДоговора КАК ДокументРасторжение
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
    |		ПО ДокументРасторжение.ЗаказДоговор.Контрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
    |			И ДокументРасторжение.Организация = ВзаиморасчетыСКонтрагентамиОстатки.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
    |		ПО ДокументРасторжение.ЗаказДоговор.Контрагент.ДокументУдостоверяющийЛичность = ДокументыУдостоверяющиеЛичность.Ссылка
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЗаказам.Остатки КАК РасчетыПоЗаказамОстатки
    |		ПО ДокументРасторжение.ЗаказДоговор = РасчетыПоЗаказамОстатки.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Монтаж КАК Монтаж
    |		ПО &ВключатьДанныеМонтажей
	|			И (Монтаж.Основание = ДокументРасторжение.ЗаказДоговор)
    |			И (НЕ Монтаж.ПометкаУдаления),
    |	Константа.ВалютаУчета КАК ВалютаУчета
    |ГДЕ
    |	ДокументРасторжение.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДокументРасторжение.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ДанныеТабличнойЧасти.Ссылка КАК Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки КАК НомерСтроки,
    |	ДанныеТабличнойЧасти.Комната КАК Комната,
    |	ВЫБОР
    |		КОГДА &КолонкаАртикул
    |			ТОГДА ДанныеТабличнойЧасти.Номенклатура.Артикул
    |		ИНАЧЕ ДанныеТабличнойЧасти.Номенклатура.Код
    |	КОНЕЦ КАК Код,
    |	ДанныеТабличнойЧасти.Номенклатура.Артикул КАК Артикул,
    |	ДанныеТабличнойЧасти.Номенклатура КАК Номенклатура,
    |	ДанныеТабличнойЧасти.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
    |	ДанныеТабличнойЧасти.Коэффициент КАК Коэффициент,
    |	ДанныеТабличнойЧасти.Количество КАК Количество,
    |	ДанныеТабличнойЧасти.Цена КАК Цена,
    |	ДанныеТабличнойЧасти.СуммаСкидки КАК СуммаСкидки,
    |	ДанныеТабличнойЧасти.Сумма КАК Сумма,
    |	ДанныеТабличнойЧасти.СтавкаНДС КАК СтавкаНДС,
    |	ДанныеТабличнойЧасти.СуммаНДС КАК СуммаНДС,
    |	ДанныеТабличнойЧасти.ПроцентСкидки КАК ПроцентСкидки,
    |	ДанныеТабличнойЧасти.Сумма + ДанныеТабличнойЧасти.СуммаСкидки КАК СуммаБезСкидки,
    |	ДанныеТабличнойЧасти.СуммаСкидки КАК Скидка,
    |	ДанныеТабличнойЧасти.Сумма - ДанныеТабличнойЧасти.СуммаНДС КАК СуммаБезНДС,
    |	ДанныеТабличнойЧасти.Сумма КАК СуммаСНДС,
    |	ДанныеТабличнойЧасти.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
	|ИЗ
    |	Документ.СоглашениеОРасторженииДоговора.ТоварыУслуги КАК ДанныеТабличнойЧасти
    |ГДЕ
    |	ДанныеТабличнойЧасти.Ссылка В(&МассивОбъектов)
    |
    |УПОРЯДОЧИТЬ ПО
    |	ДанныеТабличнойЧасти.Ссылка,
    |	ДанныеТабличнойЧасти.НомерСтроки
    |ИТОГИ ПО
    |	Ссылка";
    
	
	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
	                                               РезультатПоШапке, РезультатПоТабличнойЧасти);
	
	Возврат СтруктураДанныхДляПечати;
    
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам=Неопределено) Экспорт
	
	Документы.ЗаказДоговор.ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Добавляет команду создания документа
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.СоглашениеОРасторженииДоговора) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.СоглашениеОРасторженииДоговора.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.СоглашениеОРасторженииДоговора.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область Прочее

Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ДеревоТоваровЦена");
	МассивИменЭлементов.Добавить("ДеревоТоваровСумма");
	
	Возврат МассивИменЭлементов;
	
КонецФункции
	
Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ДеревоТоваровПроцентСкидки");
	МассивИменЭлементов.Добавить("ДеревоТоваровСуммаСкидки");
	
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаПотолок");
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуНаУслуги");
	МассивИменЭлементов.Добавить("ДеревоТоваровИзменитьСкидкуТовары");
	МассивИменЭлементов.Добавить("ДеревоТоваровОчиститьСкидки");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
